In [1]:
import pandas as pd
df = pd.read_csv("round_2_dataset.csv")
print(df.head())

    feature1   feature2
0  37.454012   1.571459
1  95.071431        NaN
2  73.199394  15.717799
3  59.865848  25.428535
4  15.601864  45.378324

In [2]:
df

     feature1   feature2
0   37.454012   1.571459
1   95.071431        NaN
2   73.199394  15.717799
3   59.865848  25.428535
4   15.601864  45.378324
..        ...        ...
95  49.379560  17.460479
96  52.273283        NaN
97  42.754102  44.855513
98   2.541913  44.354321
99  10.789143  38.993777

[100 rows x 2 columns]

In [3]:
removenan = df.dropna(subset=['feature2'])

In [4]:
removenan

     feature1   feature2
0   37.454012   1.571459
2   73.199394  15.717799
3   59.865848  25.428535
4   15.601864  45.378324
5   15.599452  12.464611
..        ...        ...
93  56.127720  31.655073
95  49.379560  17.460479
97  42.754102  44.855513
98   2.541913  44.354321
99  10.789143  38.993777

[80 rows x 2 columns]

In [5]:
from sklearn.preprocessing import MinMaxScaler

scaler = MinMaxScaler()

removenan['feature1'] = scaler.fit_transform(removenan[['feature1']])

/tmp/ipykernel_15357/3389937356.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  removenan['feature1'] = scaler.fit_transform(removenan[['feature1']])

In [6]:
removenan

    feature1   feature2
0   0.376025   1.571459
2   0.740267  15.717799
3   0.604399  25.428535
4   0.153354  45.378324
5   0.153330  12.464611
..       ...        ...
93  0.566308  31.655073
95  0.497545  17.460479
97  0.430033  44.855513
98  0.020275  44.354321
99  0.104313  38.993777

[80 rows x 2 columns]

In [7]:
json_output = removenan.head(5).to_json(orient='records')

In [8]:
print(json_output)

[{"feature1":0.3760253011,"feature2":1.5714592843},{"feature1":0.7402668307,"feature2":15.7177990538},{"feature1":0.6043994601,"feature2":25.4285345582},{"feature1":0.1533543085,"feature2":45.3783236963},{"feature1":0.1533297304,"feature2":12.4646114574}]